### Pandas-Dataframe And Series

##### Pandas is a powerful data manipulation library in python, widely used for data analysis and data cleaning. it provides two primary data structures : Series and DataFrame.
##### A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneus tabular data structure with labeled axes (rows and columns).

In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\mrutyunjay\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mrutyunjay\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\mrutyunjay\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
    --------------------------------------- 0.3/11.5 MB ? eta -:--:--
    --------------------------------------- 0.3/11.5 MB ? eta -:--:--
    --------------------------------------- 0.3/11.5 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.5 MB 508.0 kB/s eta 0:00:22
   - -------------------------------------- 0.5/11.5 MB 508.0 kB/s eta 0:00:22
   -- ------------------------------------- 0.8/11.5 MB 578.7 kB/s eta 0:00:19
   -- ------------------------------------- 0.8/11.5 MB 578.7 kB/s eta 0:00:19
   --- ------------------------------------ 1.0/11.5 MB 636.8 kB/s eta 0:00:17
   ---- ----------------------------------- 1.3/11.5 MB 677.8 kB/s eta 0:00:16
   ----- ---------------------------------- 1.6/11.5 MB 717.0 kB/s eta 0:00:14
   ----- ---------------------------------- 1.6/11.5 MB 717.0 kB/s eta 0:00:14
   ----- ---------------------------------- 1.6/11.5 MB 717.0 kB/s eta 0:00:14
   ----- ---------------------------------- 1.6/11.5 MB 717.0 kB/s eta 0:00:14
   ------ --------------------------------- 1.8/11.5 MB 637.0 kB/s eta 0:00:16
   ------- -------------------------------- 2.1/11.5 MB 674.9 kB/s eta 0:00:14
   -------- ------------------------------- 2.4/11.5 MB 710.2 kB/s eta 0:00:13
   --------- ------------------------------ 2.6/11.5 MB 747.6 kB/s eta 0:00:12
   ---------- ----------------------------- 2.9/11.5 MB 783.9 kB/s eta 0:00:11
   ---------- ----------------------------- 3.1/11.5 MB 820.1 kB/s eta 0:00:11
   ----------- ---------------------------- 3.4/11.5 MB 845.9 kB/s eta 0:00:10
   ------------ --------------------------- 3.7/11.5 MB 865.4 kB/s eta 0:00:10
   -------------- ------------------------- 4.2/11.5 MB 928.5 kB/s eta 0:00:08
   --------------- ------------------------ 4.5/11.5 MB 955.2 kB/s eta 0:00:08
   ----------------- ---------------------- 5.0/11.5 MB 1.0 MB/s eta 0:00:07
   ------------------- -------------------- 5.5/11.5 MB 1.1 MB/s eta 0:00:06
   -------------------- ------------------- 6.0/11.5 MB 1.1 MB/s eta 0:00:05
   --------------------- ------------------ 6.3/11.5 MB 1.2 MB/s eta 0:00:05
   ----------------------- ---------------- 6.8/11.5 MB 1.2 MB/s eta 0:00:04
   ------------------------- -------------- 7.3/11.5 MB 1.2 MB/s eta 0:00:04
   --------------------------- ------------ 7.9/11.5 MB 1.3 MB/s eta 0:00:03
   ---------------------------- ----------- 8.1/11.5 MB 1.3 MB/s eta 0:00:03
   ------------------------------ --------- 8.7/11.5 MB 1.3 MB/s eta 0:00:03
   ------------------------------ --------- 8.9/11.5 MB 1.3 MB/s eta 0:00:02
   -------------------------------- ------- 9.4/11.5 MB 1.4 MB/s eta 0:00:02
   --------------------------------- ------ 9.7/11.5 MB 1.4 MB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 1.4 MB/s eta 0:00:01
   ------------------------------------ --- 10.5/11.5 MB 1.4 MB/s eta 0:00:01
   -------------------------------------- - 11.0/11.5 MB 1.4 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 1.5 MB/s eta 0:00:00
Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
Downloading tzdata-2024.2-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2024.2 tzdata-2024.2

In [3]:
import pandas as pd

In [6]:
## Series

import pandas as pd
data = [1,2,3,4,5]
series=pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
## Create a Series from dictionary elements

data = {'a':1, 'b':2, 'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [8]:
data = [10, 20, 30]
index=['a', 'b', 'c']
pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [9]:
## DataFrame

## Create a dataframe from dictionary of list

data={
    'Name': ['Manzil', 'Sahil', 'Jack'],
    'Age': [25, 30, 45],
    'City': ['Bangalore', 'New York', 'Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age       City
0  Manzil   25  Bangalore
1   Sahil   30   New York
2    Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [10]:
import numpy as np
np.array(df)

array([['Manzil', 25, 'Bangalore'],
       ['Sahil', 30, 'New York'],
       ['Jack', 45, 'Florida']], dtype=object)

In [11]:
## Create a Data Frame From a List of Dictionaries

data=[
    {'Name': 'Mrutyunjay', 'Age': 25, 'City': 'Bangalore'},
    {'Name': 'Manzil', 'Age': 32, 'City': 'Bangalore'},
    {'Name': 'John', 'Age': 34, 'City': 'Bangalore'},
    {'Name': 'Jack', 'Age': 32, 'City': 'Bangalore'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

         Name  Age       City
0  Mrutyunjay   25  Bangalore
1      Manzil   32  Bangalore
2        John   34  Bangalore
3        Jack   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [12]:
df=pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [13]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [19]:
## Accessing Data From Dataframe

data={
    'Name': ['Manzil', 'Sahil', 'Jack'],
    'Age': [25, 30, 45],
    'City': ['Bangalore', 'New York', 'Florida']
}

df=pd.DataFrame(data)
df

     Name  Age       City
0  Manzil   25  Bangalore
1   Sahil   30   New York
2    Jack   45    Florida

In [22]:
df['Name']

0    Manzil
1     Sahil
2      Jack
Name: Name, dtype: object

In [23]:
df.loc[0]

Name       Manzil
Age            25
City    Bangalore
Name: 0, dtype: object

In [24]:
df.iloc[0]

Name       Manzil
Age            25
City    Bangalore
Name: 0, dtype: object

In [25]:
df.loc[0][0]

C:\Users\MRUTYUNJAY\AppData\Local\Temp\ipykernel_14544\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Manzil'

In [26]:
df.iloc[0][2]

C:\Users\MRUTYUNJAY\AppData\Local\Temp\ipykernel_14544\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Bangalore'

In [31]:
## Accessing a specified element

print(df.at[2,'Age'])

45

In [32]:
print(df.at[2,'Name'])

Jack

In [33]:
## Accessing specified elements using iat

df.iat[2, 2]

'Florida'

In [34]:
## Data Manipulation with Dataframe

df

     Name  Age       City
0  Manzil   25  Bangalore
1   Sahil   30   New York
2    Jack   45    Florida

In [ ]:
## Adding a column

df['Salary']=[50000, 60000, 70000]
df

     Name  Age       City  Salary
0  Manzil   25  Bangalore   50000
1   Sahil   30   New York   60000
2    Jack   45    Florida   70000

In [37]:
## Remove a column

df.drop('Salary', axis=1)

     Name  Age       City
0  Manzil   25  Bangalore
1   Sahil   30   New York
2    Jack   45    Florida

In [38]:
df

     Name  Age       City  Salary
0  Manzil   25  Bangalore   50000
1   Sahil   30   New York   60000
2    Jack   45    Florida   70000

In [39]:
df.drop('Salary', axis=1, inplace=True)

In [40]:
df

     Name  Age       City
0  Manzil   25  Bangalore
1   Sahil   30   New York
2    Jack   45    Florida

In [41]:
## Add Age to the column

df['Age']=df['Age']+1
df

     Name  Age       City
0  Manzil   26  Bangalore
1   Sahil   31   New York
2    Jack   46    Florida

In [42]:
df.drop(0)

    Name  Age      City
1  Sahil   31  New York
2   Jack   46   Florida

In [43]:
df

     Name  Age       City
0  Manzil   26  Bangalore
1   Sahil   31   New York
2    Jack   46    Florida

In [44]:
df.drop(0, inplace=True)

In [45]:
df

    Name  Age      City
1  Sahil   31  New York
2   Jack   46   Florida

In [49]:
dfd=pd.read_csv('data.csv')

print("Data types:\n", dfd.dtypes)

print("Statistical Summary:\n", dfd.describe())

Data types:
 Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object
Statistical Summary:
            Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [50]:
dfd.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000